def multiply(a, b):
    return a * b

result = multiply(5, 3)
print(result)


#isalnum()---ამოწმებს, შეიცავს თუ არა სტრიქონი მხოლოდ ასოებს და ციფრებს.

#თუ მხოლოდ ასოები ან ციფრებია, აბრუნებს True.
#წინააღმდეგ შემთხვევაში აბრუნებს False.

#მაგალითი:

str = "Hello123"
print(str.isalnum())   # True

str2 = "Hello 123"
print(str2.isalnum())  # False, რადგან შიგნით არის სიცარიელე









#isdigit()---ამოწმებს, შეიცავს თუ არა სტრიქონი მხოლოდ ციფრებს.

#თუ ყველა სიმბოლო ციფრია, აბრუნებს True.
#წინააღმდეგ შემთხვევაში აბრუნებს False.

#მაგალითი:

int = "12345"
print(int.isdigit())   # True

int2 = "123abc"
print(int2.isdigit())  # False, რადგან სტრიქონში ასოებია









# islower()---ამოწმებს, არის თუ არა ყველა ასო პატარა სტრიქონში.

#თუ ყველა ასო წვრილი ასოა, აბრუნებს True.
#წინააღმდეგ შემთხვევაში აბრუნებს False.

#მაგალითი:

word = "hello"
print(word.islower())  # True

word2 = "Hello"
print(word2.islower())  # False, რადგან ერთი ასო დიდი ასოა








#isnumeric()---ამოწმებს, შეიცავს თუ არა სტრიქონი მხოლოდ რიცხვებს.

#აბრუნებს True მხოლოდ იმ შემთხვევაში, თუ ყველა სიმბოლო რიცხვია.

#მაგალითი:

nums = "12345"
print(nums.isnumeric())  # True

nums2 = "123.45"
print(nums2.isnumeric())  # False, რადგან სტრიქონში წერტილი







#isupper()---ამოწმებს, არის თუ არა ყველა ასო დიდი სტრიქონში.

#თუ ყველა ასო დიდი ასოა, აბრუნებს True.
#წინააღმდეგ შემთხვევაში აბრუნებს False.

#მაგალითი:

s = "HELLO"
print(s.isupper())  # True

s2 = "Hello"
print(s2.isupper())  # False, რადგან ერთი ასო პატარა ასოა








#min()---აბრუნებს ყველაზე მცირე  მნიშვნელობას მოცემულ მონაცემთა კოლექციაში.

#max() აბრუნებს ყველაზე დიდ  მნიშვნელობას მოცემულ მონაცემთა კოლექციაში.







